#include "global.h"
#include "battle_main.h"
#include "battle_setup.h"
#include "bg.h"
#include "data.h"
#include "daycare.h"
#include "decompress.h"
#include "dexnav.h"
#include "event_data.h"
#include "event_object_movement.h"
#include "event_scripts.h"
#include "field_effect.h"
#include "field_effect_helpers.h"
#include "field_message_box.h"
#include "field_player_avatar.h"
#include "field_screen_effect.h"
#include "fieldmap.h"
#include "gpu_regs.h"
#include "graphics.h"
#include "item.h"
#include "m4a.h"
#include "map_name_popup.h"
#include "main.h"
#include "malloc.h"
#include "menu.h"
#include "menu_helpers.h"
#include "metatile_behavior.h"
#include "new_menu_helpers.h"
#include "overworld.h"
#include "palette.h"
#include "party_menu.h"
#include "pokedex.h"
#include "pokemon.h"
#include "pokemon_icon.h"
#include "pokemon_summary_screen.h"
#include "random.h"
#include "region_map.h"
#include "scanline_effect.h"
#include "script.h"
#include "script_pokemon_util.h"
#include "sound.h"
#include "sprite.h"
#include "start_menu.h"
#include "string_util.h"
#include "strings.h"
#include "task.h"
#include "text.h"
#include "text_window.h"
#include "wild_encounter.h"
#include "window.h"
#include "constants/daycare.h"
#include "constants/map_types.h"
#include "constants/species.h"
#include "constants/maps.h"
#include "constants/field_effects.h"
#include "constants/items.h"
#include "constants/songs.h"
#include "constants/abilities.h"
#include "constants/region_map_sections.h"
#include "gba/m4a_internal.h"

// gui tags
#define ICON_GFX_TAG            55130
#define ICON_PAL_TAG            56000
#define SELECTION_CURSOR_TAG    0x4005

// search tags
#define LIT_STAR_TILE_TAG       0x4010
#define HELD_ITEM_TAG           0xd750

// Defines
enum
{
    WINDOW_INFO,
    WINDOW_MAP_NAME,
    WINDOW_MESSAGE,
};

enum
{
    DEXNAV_MSG_CHOOSE_POKEMON,
    DEXNAV_MSG_SEARCH_POKEMON,
    DEXNAV_MSG_NO_DATA,
};

struct DexNavSearch
{
    /*0x00*/ u16 species;
    /*0x02*/ u16 moves[MAX_MON_MOVES];
    /*0x0A*/ u16 heldItem;
    /*0x0C*/ u8 abilityNum:1;
	         u8 abilityHidden:1;
			 u8 unused:6;
	/*0x0D*/ u8 potential;
	/*0x0E*/ u8 monLevel;
	/*0x0F*/ u8 proximity;
	/*0x10*/ s16 tileX;
	/*0x12*/ s16 tileY;
	/*0x14*/ u8 environment;
	/*0x15*/ u8 fldEffSpriteId;
    /*0x16*/ u8 fldEffId;
	/*0x17*/ u8 movementCount;
	/*0x18*/ u8 windowId;
    /*0x19*/ u8 iconSpriteId;
    /*0x1A*/ u8 itemSpriteId;
    /*0x1B*/ u8 ownedIconSpriteId;
    /*0x1C*/ u8 starSpriteIds[3];
};

struct DexNavGUI
{
    MainCallback savedCallback;
    u16 landSpecies[LAND_WILD_COUNT];
    u16 waterSpecies[WATER_WILD_COUNT];
    u8 tilemapBuffer[0x800];
    u8 environment;
    u8 potential;
    u8 cursorSpriteId;
    u8 cursorRow;
    u8 cursorCol;
};

// Function Declarations
// GUI
static void Task_DexNavMain(u8 taskId);
static void PrintCurrentSpeciesInfo(void);
static void DexNavUpdateSelection(void);
static void PrintDexNavMessage(u8 msgId);
// SEARCH
static bool8 TryStartHiddenMonFieldEffect(u8 environment, u8 xSize, u8 ySize);
static u16 DexNavGenerateMoveset(u16 species, u8 encounterLevel, u16* moveDst);
static u16 DexNavGenerateHeldItem(u16 species);
static bool8 DexNavGetAbilityNum(u16 species);
static u8 DexNavGeneratePotential(void);
static u8 DexNavTryGenerateMonLevel(u16 species, u8 environment);
static u8 GetEncounterLevelFromMapData(u16 species, u8 environment);
